Задание 1

In [9]:
import pandas as pd

In [3]:
data = pd.read_csv('D:/Programm Files/Sturdy/Homework/Data/ml-20m/ratings.csv')

In [14]:
data2 = pd.read_csv('D:/Programm Files/Sturdy/Homework/Data/ml-20m/movies.csv')

In [4]:
data.head()

   userId  movieId  rating   timestamp
0       1        2     3.5  1112486027
1       1       29     3.5  1112484676
2       1       32     3.5  1112484819
3       1       47     3.5  1112484727
4       1       50     3.5  1112484580

In [5]:
data = data[ data.rating == 5.0 ]

In [72]:
data['movieId'].value_counts().head(1)

318    31896
Name: movieId, dtype: int64

In [23]:
data['movieId'].mode()

0    318
dtype: int64

In [77]:
data2.query(f'movieId == {318}').head()

     movieId                             title       genres
315      318  Shawshank Redemption, The (1994)  Crime|Drama

Задание 2

In [24]:
energy_data = pd.read_csv('D:/Programm Files/Sturdy/Homework/Data/power.csv')

In [25]:
energy_data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [42]:
filt_energy_data = energy_data[ (energy_data['quantity'] > 0) & (energy_data['year'] >= 2005) & (energy_data['year'] <=2010) &
                               ((energy_data['category'] == 4) | (energy_data['category'] == 12) | (energy_data['category'] == 21)) &
                               ((energy_data['country'] == 'Estonia') | (energy_data['country'] == 'Lithuania') | (energy_data['country'] == 'Latvia')) ]

In [97]:
filt_energy_data.head()

         country  year  quantity  category
10617    Estonia  2008       1.0         4
10620    Estonia  2005       1.0         4
11156  Lithuania  2008       1.0         4
11158  Lithuania  2006       1.0         4
11159  Lithuania  2005       1.0         4

In [40]:
energy_data[ energy_data['country'].str.contains('Lat', case=False) ]['country'].unique()

array(['Latvia'], dtype=object)

In [52]:
filt_energy_data['quantity'].sum()

240580.0

Задание 3

In [93]:
web = pd.read_html('https://fortrader.org/quotes')[1]

In [96]:
web

,Название,Цена,Изменение,Изменение(%),Обновлено
0,Нефть Brent Курс нефти сегодня,65.07,-3.78,-5.49,NaN
1,Нефть WTI Цены на нефть WTI,61.92,-3.59,-5.48,NaN
2,Природный газ Цена на природный газ,2.93,-0.05,-1.55,NaN
3,Кофе,145.00,0.00,0.00,NaN
4,Кукуруза,663.00,18.40,2.85,NaN
5,Соя,400.30,-19.60,-4.67,NaN
6,Хлопок,81.70,-0.73,-0.89,NaN